espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG22/Include/efr32fg22_iadc.h
/* Bit fields for IADC STATUS */
#define _IADC_STATUS_RESETVALUE                         0x00000000UL                                     /**< Default value for IADC_STATUS               */
#define _IADC_STATUS_MASK                               0x4131CF5BUL                                     /**< Mask for IADC_STATUS                        */
#define IADC_STATUS_SINGLEQEN                           (0x1UL << 0)                                     /**< Single Queue Enabled                        */
#define _IADC_STATUS_SINGLEQEN_SHIFT                    0                                                /**< Shift value for IADC_SINGLEQEN              */
#define _IADC_STATUS_SINGLEQEN_MASK                     0x1UL                                            /**< Bit mask for IADC_SINGLEQEN                 */
#define _IADC_STATUS_SINGLEQEN_DEFAULT                  0x00000000UL                                     /**< Mode DEFAULT for IADC_STATUS                */
#define IADC_STATUS_SINGLEQEN_DEFAULT                   (_IADC_STATUS_SINGLEQEN_DEFAULT << 0)            /**< Shifted mode DEFAULT for IADC_STATUS        */
#define IADC_STATUS_SINGLEQUEUEPENDING                  (0x1UL << 1)                                     /**< Single Queue Pending                        */
#define _IADC_STATUS_SINGLEQUEUEPENDING_SHIFT           1                                                /**< Shift value for IADC_SINGLEQUEUEPENDING     */
#define _IADC_STATUS_SINGLEQUEUEPENDING_MASK            0x2UL                                            /**< Bit mask for IADC_SINGLEQUEUEPENDING        */
#define _IADC_STATUS_SINGLEQUEUEPENDING_DEFAULT         0x00000000UL                                     /**< Mode DEFAULT for IADC_STATUS                */
#define IADC_STATUS_SINGLEQUEUEPENDING_DEFAULT          (_IADC_STATUS_SINGLEQUEUEPENDING_DEFAULT << 1)   /**< Shifted mode DEFAULT for IADC_STATUS        */
#define IADC_STATUS_SCANQEN                             (0x1UL << 3)                                     /**< Scan Queued Enabled                         */
#define _IADC_STATUS_SCANQEN_SHIFT                      3                                                /**< Shift value for IADC_SCANQEN                */
#define _IADC_STATUS_SCANQEN_MASK                       0x8UL                                            /**< Bit mask for IADC_SCANQEN                   */
#define _IADC_STATUS_SCANQEN_DEFAULT                    0x00000000UL                                     /**< Mode DEFAULT for IADC_STATUS                */
#define IADC_STATUS_SCANQEN_DEFAULT                     (_IADC_STATUS_SCANQEN_DEFAULT << 3)              /**< Shifted mode DEFAULT for IADC_STATUS        */
#define IADC_STATUS_SCANQUEUEPENDING                    (0x1UL << 4)                                     /**< Scan Queue Pending                          */
#define _IADC_STATUS_SCANQUEUEPENDING_SHIFT             4                                                /**< Shift value for IADC_SCANQUEUEPENDING       */
#define _IADC_STATUS_SCANQUEUEPENDING_MASK              0x10UL                                           /**< Bit mask for IADC_SCANQUEUEPENDING          */
#define _IADC_STATUS_SCANQUEUEPENDING_DEFAULT           0x00000000UL                                     /**< Mode DEFAULT for IADC_STATUS                */
#define IADC_STATUS_SCANQUEUEPENDING_DEFAULT            (_IADC_STATUS_SCANQUEUEPENDING_DEFAULT << 4)     /**< Shifted mode DEFAULT for IADC_STATUS        */
#define IADC_STATUS_CONVERTING                          (0x1UL << 6)                                     /**< Converting                                  */
#define _IADC_STATUS_CONVERTING_SHIFT                   6                                                /**< Shift value for IADC_CONVERTING             */
#define _IADC_STATUS_CONVERTING_MASK                    0x40UL                                           /**< Bit mask for IADC_CONVERTING                */
#define _IADC_STATUS_CONVERTING_DEFAULT                 0x00000000UL                                     /**< Mode DEFAULT for IADC_STATUS                */
#define IADC_STATUS_CONVERTING_DEFAULT                  (_IADC_STATUS_CONVERTING_DEFAULT << 6)           /**< Shifted mode DEFAULT for IADC_STATUS        */
#define IADC_STATUS_SINGLEFIFODV                        (0x1UL << 8)                                     /**< SINGLEFIFO Data Valid                       */
#define _IADC_STATUS_SINGLEFIFODV_SHIFT                 8                                                /**< Shift value for IADC_SINGLEFIFODV           */
#define _IADC_STATUS_SINGLEFIFODV_MASK                  0x100UL                                          /**< Bit mask for IADC_SINGLEFIFODV              */
#define _IADC_STATUS_SINGLEFIFODV_DEFAULT               0x00000000UL                                     /**< Mode DEFAULT for IADC_STATUS                */
#define IADC_STATUS_SINGLEFIFODV_DEFAULT                (_IADC_STATUS_SINGLEFIFODV_DEFAULT << 8)         /**< Shifted mode DEFAULT for IADC_STATUS        */
#define IADC_STATUS_SCANFIFODV                          (0x1UL << 9)                                     /**< SCANFIFO Data Valid                         */
#define _IADC_STATUS_SCANFIFODV_SHIFT                   9                                                /**< Shift value for IADC_SCANFIFODV             */
#define _IADC_STATUS_SCANFIFODV_MASK                    0x200UL                                          /**< Bit mask for IADC_SCANFIFODV                */
#define _IADC_STATUS_SCANFIFODV_DEFAULT                 0x00000000UL                                     /**< Mode DEFAULT for IADC_STATUS                */
#define IADC_STATUS_SCANFIFODV_DEFAULT                  (_IADC_STATUS_SCANFIFODV_DEFAULT << 9)           /**< Shifted mode DEFAULT for IADC_STATUS        */
#define IADC_STATUS_SINGLEFIFOFLUSHING                  (0x1UL << 14)                                    /**< The Single FIFO is flushing                 */
#define _IADC_STATUS_SINGLEFIFOFLUSHING_SHIFT           14                                               /**< Shift value for IADC_SINGLEFIFOFLUSHING     */
#define _IADC_STATUS_SINGLEFIFOFLUSHING_MASK            0x4000UL                                         /**< Bit mask for IADC_SINGLEFIFOFLUSHING        */
#define _IADC_STATUS_SINGLEFIFOFLUSHING_DEFAULT         0x00000000UL                                     /**< Mode DEFAULT for IADC_STATUS                */
#define IADC_STATUS_SINGLEFIFOFLUSHING_DEFAULT          (_IADC_STATUS_SINGLEFIFOFLUSHING_DEFAULT << 14)  /**< Shifted mode DEFAULT for IADC_STATUS        */
#define IADC_STATUS_SCANFIFOFLUSHING                    (0x1UL << 15)                                    /**< The Scan FIFO is flushing                   */
#define _IADC_STATUS_SCANFIFOFLUSHING_SHIFT             15                                               /**< Shift value for IADC_SCANFIFOFLUSHING       */
#define _IADC_STATUS_SCANFIFOFLUSHING_MASK              0x8000UL                                         /**< Bit mask for IADC_SCANFIFOFLUSHING          */
#define _IADC_STATUS_SCANFIFOFLUSHING_DEFAULT           0x00000000UL                                     /**< Mode DEFAULT for IADC_STATUS                */
#define IADC_STATUS_SCANFIFOFLUSHING_DEFAULT            (_IADC_STATUS_SCANFIFOFLUSHING_DEFAULT << 15)    /**< Shifted mode DEFAULT for IADC_STATUS        */
#define IADC_STATUS_TIMERACTIVE                         (0x1UL << 16)                                    /**< Timer Active                                */
#define _IADC_STATUS_TIMERACTIVE_SHIFT                  16                                               /**< Shift value for IADC_TIMERACTIVE            */
#define _IADC_STATUS_TIMERACTIVE_MASK                   0x10000UL                                        /**< Bit mask for IADC_TIMERACTIVE               */
#define _IADC_STATUS_TIMERACTIVE_DEFAULT                0x00000000UL                                     /**< Mode DEFAULT for IADC_STATUS                */
#define IADC_STATUS_TIMERACTIVE_DEFAULT                 (_IADC_STATUS_TIMERACTIVE_DEFAULT << 16)         /**< Shifted mode DEFAULT for IADC_STATUS        */
#define IADC_STATUS_SINGLEWRITEPENDING                  (0x1UL << 20)                                    /**< SINGLE write pending                        */
#define _IADC_STATUS_SINGLEWRITEPENDING_SHIFT           20                                               /**< Shift value for IADC_SINGLEWRITEPENDING     */
#define _IADC_STATUS_SINGLEWRITEPENDING_MASK            0x100000UL                                       /**< Bit mask for IADC_SINGLEWRITEPENDING        */
#define _IADC_STATUS_SINGLEWRITEPENDING_DEFAULT         0x00000000UL                                     /**< Mode DEFAULT for IADC_STATUS                */
#define IADC_STATUS_SINGLEWRITEPENDING_DEFAULT          (_IADC_STATUS_SINGLEWRITEPENDING_DEFAULT << 20)  /**< Shifted mode DEFAULT for IADC_STATUS        */
#define IADC_STATUS_MASKREQWRITEPENDING                 (0x1UL << 21)                                    /**< MASKREQ write pending                       */
#define _IADC_STATUS_MASKREQWRITEPENDING_SHIFT          21                                               /**< Shift value for IADC_MASKREQWRITEPENDING    */
#define _IADC_STATUS_MASKREQWRITEPENDING_MASK           0x200000UL                                       /**< Bit mask for IADC_MASKREQWRITEPENDING       */
#define _IADC_STATUS_MASKREQWRITEPENDING_DEFAULT        0x00000000UL                                     /**< Mode DEFAULT for IADC_STATUS                */
#define IADC_STATUS_MASKREQWRITEPENDING_DEFAULT         (_IADC_STATUS_MASKREQWRITEPENDING_DEFAULT << 21) /**< Shifted mode DEFAULT for IADC_STATUS        */
#define IADC_STATUS_SYNCBUSY                            (0x1UL << 24)                                    /**< SYNCBUSY                                    */
#define _IADC_STATUS_SYNCBUSY_SHIFT                     24                                               /**< Shift value for IADC_SYNCBUSY               */
#define _IADC_STATUS_SYNCBUSY_MASK                      0x1000000UL                                      /**< Bit mask for IADC_SYNCBUSY                  */
#define _IADC_STATUS_SYNCBUSY_DEFAULT                   0x00000000UL                                     /**< Mode DEFAULT for IADC_STATUS                */
#define IADC_STATUS_SYNCBUSY_DEFAULT                    (_IADC_STATUS_SYNCBUSY_DEFAULT << 24)            /**< Shifted mode DEFAULT for IADC_STATUS        */
#define IADC_STATUS_ADCWARM                             (0x1UL << 30)                                    /**< ADCWARM                                     */
#define _IADC_STATUS_ADCWARM_SHIFT                      30                                               /**< Shift value for IADC_ADCWARM                */
#define _IADC_STATUS_ADCWARM_MASK                       0x40000000UL                                     /**< Bit mask for IADC_ADCWARM                   */
#define _IADC_STATUS_ADCWARM_DEFAULT                    0x00000000UL                                     /**< Mode DEFAULT for IADC_STATUS                */
#define IADC_STATUS_ADCWARM_DEFAULT                     (_IADC_STATUS_ADCWARM_DEFAULT << 30)             /**< Shifted mode DEFAULT for IADC_STATUS        */

/* Bit fields for IADC MASKREQ */
#define _IADC_MASKREQ_RESETVALUE                        0x00000000UL                         /**< Default value for IADC_MASKREQ              */
#define _IADC_MASKREQ_MASK                              0x0000FFFFUL                         /**< Mask for IADC_MASKREQ                       */
#define _IADC_MASKREQ_MASKREQ_SHIFT                     0                                    /**< Shift value for IADC_MASKREQ                */
#define _IADC_MASKREQ_MASKREQ_MASK                      0xFFFFUL                             /**< Bit mask for IADC_MASKREQ                   */
#define _IADC_MASKREQ_MASKREQ_DEFAULT                   0x00000000UL                         /**< Mode DEFAULT for IADC_MASKREQ               */
#define IADC_MASKREQ_MASKREQ_DEFAULT                    (_IADC_MASKREQ_MASKREQ_DEFAULT << 0) /**< Shifted mode DEFAULT for IADC_MASKREQ       */

/* Bit fields for IADC STMASK */
#define _IADC_STMASK_RESETVALUE                         0x00000000UL                       /**< Default value for IADC_STMASK               */
#define _IADC_STMASK_MASK                               0x0000FFFFUL                       /**< Mask for IADC_STMASK                        */
#define _IADC_STMASK_STMASK_SHIFT                       0                                  /**< Shift value for IADC_STMASK                 */
#define _IADC_STMASK_STMASK_MASK                        0xFFFFUL                           /**< Bit mask for IADC_STMASK                    */
#define _IADC_STMASK_STMASK_DEFAULT                     0x00000000UL                       /**< Mode DEFAULT for IADC_STMASK                */
#define IADC_STMASK_STMASK_DEFAULT                      (_IADC_STMASK_STMASK_DEFAULT << 0) /**< Shifted mode DEFAULT for IADC_STMASK        */

/* Bit fields for IADC CMPTHR */
#define _IADC_CMPTHR_RESETVALUE                         0x00000000UL                      /**< Default value for IADC_CMPTHR               */
#define _IADC_CMPTHR_MASK                               0xFFFFFFFFUL                      /**< Mask for IADC_CMPTHR                        */
#define _IADC_CMPTHR_ADLT_SHIFT                         0                                 /**< Shift value for IADC_ADLT                   */
#define _IADC_CMPTHR_ADLT_MASK                          0xFFFFUL                          /**< Bit mask for IADC_ADLT                      */
#define _IADC_CMPTHR_ADLT_DEFAULT                       0x00000000UL                      /**< Mode DEFAULT for IADC_CMPTHR                */
#define IADC_CMPTHR_ADLT_DEFAULT                        (_IADC_CMPTHR_ADLT_DEFAULT << 0)  /**< Shifted mode DEFAULT for IADC_CMPTHR        */
#define _IADC_CMPTHR_ADGT_SHIFT                         16                                /**< Shift value for IADC_ADGT                   */
#define _IADC_CMPTHR_ADGT_MASK                          0xFFFF0000UL                      /**< Bit mask for IADC_ADGT                      */
#define _IADC_CMPTHR_ADGT_DEFAULT                       0x00000000UL                      /**< Mode DEFAULT for IADC_CMPTHR                */
#define IADC_CMPTHR_ADGT_DEFAULT                        (_IADC_CMPTHR_ADGT_DEFAULT << 16) /**< Shifted mode DEFAULT for IADC_CMPTHR        */

